{"pages":[{"title":"","text":"","link":"/404.html"},{"title":"about","text":"μ’ｓ限界ヲタクやってます。 おスマホ ﾊﾟｿﾝﾖﾖ github Twitter Kyash mastodon おスマホiphone6s - 12.4xiaomi mi mix2s - floko ﾊﾟｿﾝﾖﾖdell inspiron 6400 - archlinux東芝 dynabook t554/45k13w - windows10 githubhttps://github.com/karin722 Twitterhttps://twitter.com/@karin722_x Kyashhttps://kyash.me/payments/acNx0e4qkT2hkHm91hWwpbpNC6T6 mastodonhttps://mstdn.maud.io/@w_jb_","link":"/about/index.html"}],"posts":[{"title":"UmiNico_kernel","text":"UmiNiko kernelの話 UmiNiko とは 成果物 10.0 おわりに UmiNiko とは Optimus_Drunk_Berylliumのpolaris移植版 blu_shedutilとかpixutilとか入ってる gpuガバナもなんかいっぱい入ってる i/oスケジューラはanxietyとmapleが追加されてます なんか色々追加されてる便利なカーネル あとはTCPなんたらにwestwood追加、急速充電on/off可能になってたりしてます(これは標準でもon/off可能…?) 成果物こ↑こ↓anykernelのそれはありません。自分でビルドしてください。近いうちに訴えますanykernel3版をリリースしたいな、というお気持ち。 10.010.0版が本家では10.0ブランチが作られてたりして結構活発なんですが、私がまだ9.0を使い続けてる関係上10.0ブランチのpolaris移植は考えてません。 おわりにスクスタにどっぷりな私ですが、twitterとか見ると賛否両論みたいですね。とくに特定のCP推しの方々はやっぱりキツイらしく、やめてる方もいましたね…。確かにあれはプレイヤー(あなた)とスクールアイドルの物語という関係上、セリフが結構アレなんですよね。つまりキャラ+プレイヤーのCPに見えなくもないっていう話です。公式的には「これが欲しかったんだろ」みたいなアレなんですけど実際そうじゃなくて、キャラだけで(プレイヤー抜きで)絡ませてほしかったのかもしれません。まぁその辺は人それぞれなので人によってはコッチのほうがいいって人もいるんでしょうけど。ちなみに私はキャラだけで絡ませてほしかった組です。うみにこ見たかったなぁ。","link":"/2019/10/03/"},{"title":"flokoまとめ","text":"あるいはromのビルドなど 前回のラブライブ mix2前半 解決法 mix2後半 mix2s 今後 前回のラブライブ mix2(chiron)用のflokoをねだる flokoええやん 何故かビルド欲が出る mix2前半 ほたさんにねだってmix2用flokoをビルドしてもらう 何故か4gつながらず 解決法4g通信したいsimをsim1スロットに挿し起動。apn等の設定を済ませた後シャットダウン、対象のsimをスロット2に差し込むと4g通信可能になります。なおromによってはsim1に入った状態でも可能な場合がある。なんでこうなるのかは分かりません… mix2後半 baikalOSベースでカーネルを弄り始める カーネル名を替えて、cpuガバナを少し追加したもの blu_schdutilの追加に成功。それ以外は動かないか選択肢に表示されなかった mix2sに無償アップグレード()したためカーネルの更新は終了。romの方は10月パッチから再開させたいな、というお気持ちですがvultrのクレジットがほぼもう無い事やそちらに注ぎ込めるｵｶﾈが無いことからビルド出来るかどうかわからない状態です。だれかiphone5を1500円で買ってください！何でもしますから！（何でもするとは言っていない） mix2s ９月パッチ前にビルド→無事成功 ９月パッチ適用後、兄弟機のpoco f1用カスタムカーネル移植作業をし始める これまたおんぶに抱っこ状態で無事成功。こちらはmix2s用にdefconfigを書き換え、名前を推しCPに変更したもの defconfig編集にはwinmargeに大変お世話になりました これのせいでビルド時間が二倍になってしまい、更に財政を圧迫させ上記のような状態になりました… ちなみに2s用カーネルの名前にもなった”うみにこ”ですが、界隈最強候補CP”にこまき”のおかげで非常に影が薄いCPです。pixivの供給も多いとは言えないので、これがまたμ’ｓロスを拗らせる原因になるときもあります（大抵の原因はｱｲﾎﾟｯﾖ） 今後 mix2s用のカーネルはなんとか面倒を見ていきたい 時間かかってもいいから自機ビルドしたい iphone5をさっさと売りたい “うみにこ”はいいぞ “にことり”も中々おすすめ。こちらは薄い本も豊富。 某大型ssサイトの閉鎖が結構キツイです。pocketに入ってるので読めるのですが、今後どうssを追っていこうか困ったもんです。","link":"/2019/09/29/"},{"title":"pixel3&ラブライブ！","text":"pixel3とラ！の話 だれだよ pixel 3 環境 準備 ビルド 回収 ラブライブ！ スクスタ ラブライブ！フェス おすすめSS おはりに この記事は末代adventCalendar22日目です。昨日は—-さんの—-でした。 だれだよ矢澤にこの限界ヲタク pixel 3mix2sに飽きたので買いました。お値段30kでいい買い物をしたと思ってます。しゃしん 今回は練習っつうか経験的なアレでAOSPをビルドしてみました。お初Android10です。 環境今回もvultrを使いました。floko(android9)をビルドしたときと同じ構成でいいだろと思い6コア16GBメモリのものを選択。ちなみに一時間0.199ドルです。OSはubuntu18.0.4を選択。vultrにはすでに19.xがありますからそちらを利用してもいいでしょう。swapは16GB作成。多分というか、これくらいないと最後の方のjavaなんたらで失敗します。物理メモリはすでに32GB以上ある方は無視して構わないと思います。 準備必要なパッケージはこれ (https://source.android.com/setup/build/initializing\\) のとおり。インストールが終わったら念の為再起動しておきましょう。 次は必要なソースをダウンロードします。これ (https://source.android.com/setup/build/downloading) のとおりにbin/repoになんかして、ビルドディレクトリを作成。入ってrepo init -uします。タグはPixel3(xl)用のandroid-10.0.0_r15を選択しました。終わったらrepo sync。常用を想定している方はここ (https://github.com/opengapps/aosp_build) をみてgappsを同梱しておきましょう。現時点でpixel3(xl)はandroid10対応版twrpがリリースされていないので後から焼けません。 ビルド. build/envsetup.shしてlunch aosp_blueline-userしてmake -jX。ビルド完了まで3時間強かかりました。 回収成果物を回収します。AOSPはlosとかと違ってzipで固めないので/bluelineにあるフォルダ以外をそのまま落としました。そしてfastboot flash -wで焼きます。これでおしまい。お疲れ様でした。 pixelの話おわり!!ここからはラ！やぞ ラブライブ！末代のライバー率低くない？なんで？？？？ スクスタ虹の推しはかすみなんですけど、最近スクスタでUR果林が出たのでそっちの話をしようと思います。いや～すき、だいすき。キャラとしても好きだしゴリラとしても好きです。最高。衣装は真姫のアレによく似たものですが、これを果林が着ると真姫とはまた違った印象を楽しめます。特におっぱいと太もも。真姫にはないものが果林にはあるので…ただ告知ツイートを見ると以前に登場したスクフェスSR果林と衣装がほぼ変わらないとの意見もあります。マント着てるだけでも全然違うんですーーーーーー！！！！！そんなんもわからんのはうんち性能からの評価も非常に高いです。旧果南顔負けのVoに高めに設定されたテクニック。自アピ31%が次SP特技に加算される特技は強力です。この特技は重複されるので準ゴリラの新ことりと組むといいかもしれません。そういえば同じような特技を事後果南が持ってましたね。ひらめきは凸なしで3スロ。フェス限らしいので常駐ガチャには出ないでしょうけど今年中にまた出るでしょどうせ(適当)と思ったけどやっぱ今年中ってか当分でなさそうみたいなのある…。 ラブライブ！フェス現地入り確定しました！！！！！！！！！！！！！！！ おすすめSS今年私がPocketに投げた作品の中でも特に性癖に刺さったモノを紹介するだけ 「[うみにこ]やりたいこと、やるべきこと」https://www.pixiv.net/novel/show.php?id=4883076 「[R-18][にことり]かわいいものクレプトマニアック」https://www.pixiv.net/novel/show.php?id=10343318 以上！！！！！！！読め！！！！！！！！！！！！！！ おはりに最近、というかついさっきx121eのxubuntuを捨ててwindows10をインストールしました。理由はradikoolが使いたいから。んで今絶賛nodeとかブラウザとかインストールしてるんですけど、案外win10動くもんですね。最初だけ？？？というわけでmarkdownが気持ちよく書けるテキストエディタとそれなりに動きそうなブラウザを募集しております。あと来年あたりにはthinkpad x280あたり買いたいですね。くれ","link":"/2019/12/22/"},{"title":"jellyfin","text":"べんりでよい はじめに サーバー選定 jellyfinインストール アルバム表示できてないやん！どうしてくれんの おわりに はじめに１月に学生限定臨時収入が入り、金銭的に余裕が出たので立ち上げてみました。そういえばそろそろラ！フェスなんですけど私の頭はまどか☆マギカのことでいっぱいです。なんでこの時期に見たの？ サーバー選定自家サーバーを持っていないのでどこかしらでレンタルサーバーを借りる必要があります。正直ヤフオクとかで10kくらいで売ってるサーバーを買ったほうがトータルで安上がりになると思うのですが、我が家の環境的に断念しました。自分の部屋に有線LANの挿入口がないとかね。サーバースペックは2coreメモリ1GB ubuntu18.x lts。今回はconohaを選択しました。同じようなスペックだとvultrのほうが安いのですが、正月のなんかでクーポン&amp;20%OFFのキャンペーンをやってたので。ただ20%OFFは一年限定なので、今年12月あたりになったらvultrに変えるかも。オーシャンなんたらはline pay使えないので断念。料金的にはvultrとかと同じくらいなんですかね？ jellyfinインストールjellyfin側が便利なインストールガイドを提供しています。コピペで楽できるのでたすかる。無事立ち上がったらメディアファイルを移します。私はfilezillaでササッと転送しました。転送後はdashboardからのmedia scanを忘れずに。 アルバム表示できてないやん！どうしてくれんのもしゃもしゃせん(断念) こんな感じにするとうまく行きます。つまりアルバム毎にフォルダ分けしてねっていうこと。私は~/Music/にflacをそのままぶち込んでいたので、foobar2000で整理してもらいました。 無事表示されました、満足。 おわりにモバイル版jellyfinを使ってると曲再生中にブチブチ切れるの私がキレそう","link":"/2020/01/13/"},{"title":"mix2s 一ヶ月使用した感想とか","text":"Q : なんでmix2s買ったんですか？ A : 悪ノリ mix2sの購入まで mix2sのここがいい！ mix2sのここがダメ！ おわりに mix2sの購入まで mix2いいんだけど重いしデカイしなんかアレ あとカメラがアレっつうか弱い 明るさ自動調整の効きがあんまよくない。フロントカメラが下にあるので… というわけでおスマホ探し。何をトチ狂ったかmix2sを購入。 mix2sのここがいい！ カメラいいわね sdm845 auバンド対応えらい 画面おっきい.. 基本的にはmix2とほぼ変わらず、細かいアップグレードが入った感じです。カメラ周りはだいぶ改善しましたね。mi8とかと同じでしたっけか。 sdm845は自分の中ではあんま評価は高くないです。確かにsdm835よりは高性能化したんでしょうけれど、やっぱり聞いていた通り熱を持ちます。sdm835だとよほど重い処理(rom焼きとか？)をしなければ45℃とかにはならなかったのに、sdm845だと普段使いでも45℃前後になります。購入する前はあまり気にしないだろうとは思っていましたが、いざ手にしてみると気になります。 auバンド対応はホントありがたいです…。他の中華スマホは全然対応してくれないのゆるさんからな mix2sのここがダメ！ 重い 片手で持つにはデカイ miuiなぁ… vendorどうにかしろ スマホは片手で使いたいのですが、この端末重いので使ってると疲れます。最近のスマホって平気で200g超えてたりするので勘弁してほしいです。170g前後のいいスマホがあるといいのですが…。 デカイ。片手使用だと手が届きません。通知センター開くのにも一苦労って感じだしなんかなぁ。oneplus,xiaomiあたりで小型スマホ出してくれたら買いたい(願望)。それかはよiphone se2だせ miuiは人によるんでしょうけど私はandroidっぽくないのであんま好きじゃないです。ただ最近はああいうゴリゴリにカスタマイズされたandroidって案外貴重だったり。そのへんはumikakiさんが書いてましたね さてvendor問題。今年の夏あたりにgithubでxiaomi系vendorが粛清されたのが記憶に新しいですが、android 10 以降のvendorに関してはgitlabかプライベートリポジトリにするのが流れらしく、android10のビルドで使用できるものはほとんどなくなってしまいました、つらE…まぁ”ほとんど”なので無くは無いです。が、また粛清される可能性もなくはないので注意が必要です。 おわりにというわけでmix2sを売却し、pixel3を購入することに決めました。現状mix2sが売れてないのでpixel3を購入してはいないのですが、手元に届いたら使用感含め書きたいなとは思ってます。はよmix2s買え 売れた – ここから(スクスタ含め)ラブライブのはなし – 最近のスクスタ事情ですが、ゴリラが全く出ずたいへん困っております。具体的にはHPTとスノハレ上級Sが取れない。現状スコア7万程度足りていない状況です。最近追加されたHPT含めピュア曲は厳しい曲が多いですね。あと飼育員がほしい。具体的には絵里かにこ。あとゴリラ一匹で絵里orにこ,ゴリラ,新ことり(所持)で組みたいです。あと花陽イべのランキング見て思ったのですが、ガチャの渋さからか早くも引退勢増えてますね。前イべ上位陣があんまいない。あんま回らなくても5万位以内入れるので楽っちゃあ楽なんですが今後が少し心配だったりします。ぷちぐるみたくならなきゃいいですが。 さてラブライブ！フェス。そういえば時間配分とかどんなもんなんかなーって考えてたんですけど、やっぱり1hずつなんですかね。そうなるとμ’sのセトリが気になるところ。ノーブラ,僕今,スノハレなんかはほぼ確定でみていいと思いますが、個人的にはユニット曲も入れてほしいですね。とくにBIBI。PFのコールをやりたいです。ファイナルのアレは今でも覚えてます。時間的には若干厳しそうですが…。うーんやっぱりA-RISEを見たい。μ’s時代にもなかったA-RISEのライブ出演ですが、フェスですよ？スクールアイドルの祭典ですよ？？？？？？？案外ありえるような気がしません？？？？？食器割聞きたいしμ’s+A-RISEのSDS来たら失神しますよ… 薄い本情報。最近渡辺のいい同人誌を見つけました。希やμ’s三年生組のえっちなアレを書いてる方のやつでaqoursのが出てるとは思いませんでした、当然即購入。えっちで最高です。やっぱりきれいなのもいいんですけどドすけべなのが最高ですね。下によく効きます。ﾚｽﾞｩ…はにことりやうみにこがほしいです。いいのがあったら教えてください、なんでもしますから！！ほのにこは特定の方が書き続けてくれててとても嬉しいです。ほのにこも悪くないです。穂乃果って誰とでも組めていいですよね。二年生組との組み合わせはもちろん、三年生との組み合わせは抜群です。そういえば一年生組のはあんまり見ませんね。私が見落としているだけかもしれないのでおすすめあったら教えてください、何でもします。 最後はμ’sの話。この前(といっても先月の話ですが)nhkFMでラブライブ三昧2を聞きましたが、やっぱりμ’sのラジオはいいですね。あのうるさい感が懐かしい。少し泣きそうになりました。帰ってきたんだなって。こういうμ’sは終わっていないとは言いますが、やはりμ’sの復活は本当にありがたいです。9周年生放送でμ’sの実質復活は本当に嬉しかった…。 そこでのくっすんの話。まぁラ！のヲタクなら聞いてる人が大半なのでいちいちここで書きませんが、半分原理と化していた私には刺さりました。やっぱり声優さんもああいうの見てるんですね。気をつけないと。","link":"/2019/11/06/"},{"title":"移行しました","text":"タイトルどおり。 きっかけ もっと詳しく でっぷろーい おわりに きっかけ イキりたい テーマいいのない はてブのホームがゴミ かと言って課金したくない もっと詳しくhttps://strks.hateblo.jp/entry/20190724/1563972095 に書いてあります でっぷろーい前回と同じくhexo+github+netlfyです。前回はまぁ色々あって断念しましたが、今回はなんとか公開まで行くことが出来ました。前回と何が変わったのかは私にも分かりません。執筆環境はinspiron 6400+Kateを使用しています。現状git,nodeが正常に使用できるのがこれしかないからです。dynabookより軽快に動作しますし…。まぁ来年辺りにはちゃんとしたPCに買い替えたいです。thinkpadシリーズとか。現状旧ブログ( https://strks.hateblo.jp/ )から記事の移行は考えてません。恥ずかしくてお見せできないようなものも含まれていますし、なにより移行が面倒なので…。markdownでエクスポート出来るようになったら考えます(やるとは言っていない)。 おわりにここは公開オナニー場です。しってた？？？？","link":"/2019/09/28/"}],"tags":[],"categories":[]}