{"pages":[{"title":"","text":"","link":"/404.html"},{"title":"about","text":"μ’ｓ限界ヲタクやってます。 おスマホ ﾊﾟｿﾝﾖﾖ github Twitter おスマホiphone6s - 12.4xiaomi mi mix2s - floko ﾊﾟｿﾝﾖﾖdell inspiron 6400 - archlinux東芝 dynabook t554/45k13w - windows10 githubhttps://github.com/karin722 Twitterhttps://twitter.com/@karin722_x","link":"/about/index.html"}],"posts":[{"title":"flokoまとめ","text":"あるいはromのビルドなど 前回のラブライブ mix2前半 解決法 mix2後半 mix2s 今後 前回のラブライブ mix2(chiron)用のflokoをねだる flokoええやん 何故かビルド欲が出る mix2前半 ほたさんにねだってmix2用flokoをビルドしてもらう 何故か4gつながらず 解決法4g通信したいsimをsim1スロットに挿し起動。apn等の設定を済ませた後シャットダウン、対象のsimをスロット2に差し込むと4g通信可能になります。なおromによってはsim1に入った状態でも可能な場合がある。なんでこうなるのかは分かりません… mix2後半 baikalOSベースでカーネルを弄り始める カーネル名を替えて、cpuガバナを少し追加したもの blu_schdutilの追加に成功。それ以外は動かないか選択肢に表示されなかったmix2sに無償アップグレード()したためカーネルの更新は終了。romの方は10月パッチから再開させたいな、というお気持ちですがvultrのクレジットがほぼもう無い事やそちらに注ぎ込めるｵｶﾈが無いことからビルド出来るかどうかわからない状態です。だれかiphone5を1500円で買ってください！何でもしますから！（何でもするとは言っていない） mix2s ９月パッチ前にビルド→無事成功 ９月パッチ適用後、兄弟機のpoco f1用カスタムカーネル移植作業をし始める これまたおんぶに抱っこ状態で無事成功。こちらはmix2s用にdefconfigを書き換え、名前を推しCPに変更したもの defconfig編集にはwinmargeに大変お世話になりました これのせいでビルド時間が二倍になってしまい、更に財政を圧迫させ上記のような状態になりました…ちなみに2s用カーネルの名前にもなった”うみにこ”ですが、界隈最強候補CP”にこまき”のおかげで非常に影が薄いCPです。pixivの供給も多いとは言えないので、これがまたμ’ｓロスを拗らせる原因になるときもあります（大抵の原因はｱｲﾎﾟｯﾖ） 今後 mix2s用のカーネルはなんとか面倒を見ていきたい 時間かかってもいいから自機ビルドしたい iphone5をさっさと売りたい “うみにこ”はいいぞ “にことり”も中々おすすめ。こちらは薄い本も豊富。 某大型ssサイトの閉鎖が結構キツイです。pocketに入ってるので読めるのですが、今後どうssを追っていこうか困ったもんです。","link":"/2019/09/29/"},{"title":"移行しました","text":"タイトルどおり。 きっかけ もっと詳しく でっぷろーい おわりに きっかけ イキりたい テーマいいのない はてブのホームがゴミ かと言って課金したくない もっと詳しくhttps://strks.hateblo.jp/entry/20190724/1563972095 に書いてあります でっぷろーい前回と同じくhexo+github+netlfyです。前回はまぁ色々あって断念しましたが、今回はなんとか公開まで行くことが出来ました。前回と何が変わったのかは私にも分かりません。執筆環境はinspiron 6400+Kateを使用しています。現状git,nodeが正常に使用できるのがこれしかないからです。dynabookより軽快に動作しますし…。まぁ来年辺りにはちゃんとしたPCに買い替えたいです。thinkpadシリーズとか。現状旧ブログ( https://strks.hateblo.jp/ )から記事の移行は考えてません。恥ずかしくてお見せできないようなものも含まれていますし、なにより移行が面倒なので…。markdownでエクスポート出来るようになったら考えます(やるとは言っていない)。 おわりにここは公開オナニー場です。しってた？？？？","link":"/2019/09/28/"}],"tags":[],"categories":[]}